{
  "characters": [
    "A cute girl with long straight brown hair, wearing a beige cardigan, white blouse, and red ribbon.",
    "A cheerful girl with short black hair, wearing a school uniform with a blue blazer and plaid skirt.",
    "A gentle girl with wavy blonde hair in twin tails, wearing a pastel pink dress with white lace.",
    "A cool girl with purple hair in a ponytail, wearing a casual hoodie and jeans.",
    "A shy girl with silver hair and glasses, wearing a knit sweater and long skirt.",
    "A sporty girl with orange hair in a high ponytail, wearing a track jacket and shorts.",
    "An elegant girl with long black hair in a half-up style, wearing a white dress with blue ribbons.",
    "A playful girl with pink hair in pigtails, wearing a striped t-shirt and overalls.",
    "A sophisticated girl with wavy auburn hair, wearing a burgundy blazer and beige slacks.",
    "A energetic girl with short green hair, wearing a yellow hoodie and denim shorts.",
    "A mysterious girl with dark blue hair covering one eye, wearing a black turtleneck and skirt.",
    "A bright girl with curly blonde hair, wearing a sunflower yellow sundress.",
    "A studious girl with brown hair in a bun, wearing round glasses and a cardigan over a shirt.",
    "A tomboyish girl with messy red hair, wearing a leather jacket and cargo pants.",
    "A dreamy girl with lavender hair in loose waves, wearing a flowing white dress.",
    "A confident girl with straight silver hair, wearing a red blazer and black pencil skirt.",
    "A bubbly girl with twin braids in caramel brown, wearing a polka dot dress.",
    "A calm girl with long teal hair, wearing a pastel blue sweater and white skirt.",
    "A artistic girl with asymmetric purple and pink hair, wearing paint-splattered overalls.",
    "A preppy girl with platinum blonde hair in a bob, wearing a plaid vest and white shirt.",
    "A gentle girl with chocolate brown hair in soft curls, wearing a cream-colored knit dress.",
    "A lively girl with short spiky orange hair, wearing a graphic tee and ripped jeans.",
    "A graceful girl with long flowing indigo hair, wearing a traditional inspired modern dress.",
    "A nerdy girl with messy black hair and large glasses, wearing a science-themed hoodie.",
    "A sweet girl with rose gold hair in ringlets, wearing a frilly pink blouse and skirt.",
    "A athletic girl with tied back brown hair, wearing a sports jersey and leggings.",
    "A gothic girl with straight black hair with purple streaks, wearing a dark Victorian dress.",
    "A cheerful girl with honey blonde hair in a side ponytail, wearing a sailor-style outfit.",
    "A bookish girl with wavy chestnut hair, wearing a turtleneck and pleated skirt.",
    "A carefree girl with windswept silver hair, wearing a loose bohemian top and shorts.",
    "A mature girl with sleek black hair in a low ponytail, wearing a business suit.",
    "A kawaii girl with pastel rainbow streaked hair, wearing a cute overall dress with a bear patch.",
    "A diligent girl with neatly tied dark brown hair, wearing a school uniform with a tie.",
    "A rebellious girl with choppy red and black hair, wearing a band t-shirt and studded jacket.",
    "A serene girl with long aqua hair, wearing a flowing mint green dress.",
    "A fashionable girl with styled blonde hair with bangs, wearing a trendy crop top and high-waisted pants.",
    "A quiet girl with straight gray hair, wearing an oversized sweater and tights.",
    "A vibrant girl with bright yellow hair in a top knot, wearing colorful streetwear.",
    "A romantic girl with curled pink hair with flowers, wearing a vintage lace dress.",
    "A tech-savvy girl with blue and white hair, wearing headphones and a tech startup hoodie.",
    "A traditional girl with long black hair with a red hairpin, wearing a modern kimono-style top.",
    "A punk girl with mohawk-style pink hair, wearing a leather vest and chains.",
    "A demure girl with soft brown hair in a French braid, wearing a modest floral dress.",
    "A adventurous girl with messy blonde hair in a ponytail, wearing a windbreaker and hiking boots.",
    "A musical girl with violet hair with a treble clef clip, wearing a band uniform.",
    "A trendy girl with ombre brown to blonde hair, wearing designer jeans and a blazer.",
    "A ethereal girl with long white hair, wearing a gossamer white gown.",
    "A determined girl with short red hair, wearing a martial arts gi.",
    "A whimsical girl with cotton candy pink and blue hair, wearing a fairy-tale inspired outfit.",
    "A practical girl with dark brown hair in a ponytail, wearing a apron over casual clothes.",
    "A regal girl with golden blonde hair in an elegant updo, wearing a deep blue formal dress.",
    "A mischievous girl with asymmetrical green hair, wearing a playful cat-eared hoodie.",
    "A intellectual girl with sleek black hair and thin-rimmed glasses, wearing a turtleneck and blazer.",
    "A sunny girl with bright orange hair in space buns, wearing a yellow sundress with sunflower print.",
    "A mysterious girl with dark purple hair covering half her face, wearing a long black coat.",
    "A nature-loving girl with leafy green hair with flower accessories, wearing an earth-toned dress.",
    "A cyber girl with neon blue hair, wearing futuristic streetwear with LED accents.",
    "A vintage girl with victory rolls in auburn hair, wearing a 1950s style dress.",
    "A casual girl with messy brown hair in a bun, wearing a comfy hoodie and sweatpants.",
    "A elegant girl with pearl white hair in a chignon, wearing a silk blouse and pencil skirt.",
    "A spirited girl with flame-red hair in wild curls, wearing a leather jacket and boots.",
    "A peaceful girl with sky blue hair in a low ponytail, wearing a soft cardigan and long skirt.",
    "A bold girl with crimson hair with gold streaks, wearing a statement jacket and designer jeans.",
    "A dancer girl with ballet bun in black hair, wearing a practice leotard and wrap skirt.",
    "A gamer girl with teal and purple streaked hair, wearing an esports team jersey.",
    "A magical girl with shimmering pink hair with star clips, wearing a cute magical costume.",
    "A country girl with braided wheat-blonde hair, wearing a plaid shirt and denim.",
    "A city girl with sleek black bob, wearing all-black minimalist fashion.",
    "A soft girl with pastel lavender hair in loose pigtails, wearing an oversized pink sweater.",
    "A warrior girl with tied-back red hair, wearing practical armor-inspired clothing.",
    "A scientist girl with white hair in a neat bun, wearing a lab coat over casual clothes.",
    "A idol girl with glossy brown hair with colorful extensions, wearing a stage costume.",
    "A retro girl with curled mint green hair, wearing vintage 80s fashion.",
    "A minimalist girl with straight ash blonde hair, wearing monochrome outfit.",
    "A fantasy girl with iridescent multicolored hair, wearing a fantasy RPG inspired outfit.",
    "A sailor girl with navy blue hair in a ponytail, wearing a nautical outfit.",
    "A gardener girl with mossy green hair with small braids, wearing overalls and a straw hat.",
    "A chef girl with tied back copper hair, wearing a chef's uniform.",
    "A winter girl with ice blue hair with snowflake clips, wearing a cozy winter coat and scarf.",
    "A summer girl with sunny yellow hair in beachy waves, wearing a flowy summer dress.",
    "A autumn girl with burnt orange and red ombre hair, wearing a cozy sweater and boots.",
    "A spring girl with cherry blossom pink hair with flowers, wearing a light pastel outfit.",
    "A rainy girl with deep blue hair, wearing a cute raincoat and rain boots.",
    "A starry girl with dark purple hair with star decorations, wearing a constellation-print dress.",
    "A moon girl with silver-white hair, wearing a crescent moon necklace and flowing dress.",
    "A sun girl with golden hair in radiant curls, wearing bright warm-toned clothes.",
    "A forest girl with deep green hair with leaf clips, wearing nature-inspired clothing.",
    "A ocean girl with aquamarine hair in waves, wearing a seashell necklace and beach outfit.",
    "A mountain girl with slate gray hair, wearing practical hiking attire.",
    "A desert girl with sandy blonde hair, wearing light breathable desert clothing.",
    "A arctic girl with pristine white hair with blue tints, wearing warm fur-trimmed clothing.",
    "A tropical girl with vibrant coral pink hair with hibiscus, wearing tropical print dress.",
    "A urban girl with edgy gray hair with colored tips, wearing streetwear with graffiti design.",
    "A suburban girl with natural brown hair, wearing comfortable everyday casual clothes.",
    "A royal girl with luxurious golden hair in elaborate braids, wearing a princess-style gown.",
    "A ninja girl with tied-back black hair, wearing modern ninja-inspired outfit.",
    "A mage girl with mystical violet hair, wearing a robe with magical symbols.",
    "A steampunk girl with bronze-tinted brown hair in Victorian curls, wearing steampunk goggles and vest."
  ],
  "backgrounds": [
    "Outdoor park background with trees, blue sky, and soft daylight.",
    "Cherry blossom garden with pink petals falling and sunny spring atmosphere.",
    "Urban street corner with modern buildings, café storefronts, and warm afternoon light.",
    "Seaside beach with ocean waves, sandy shore, and bright summer sky.",
    "Library interior with wooden bookshelves, warm lighting, and cozy reading atmosphere.",
    "School classroom with desks, blackboard, and sunlight streaming through windows.",
    "Rooftop terrace with city skyline view and sunset orange sky.",
    "Flower field with colorful wildflowers, rolling hills, and clear blue sky.",
    "Coffee shop interior with wooden tables, hanging plants, and soft ambient lighting.",
    "Shopping district with colorful storefronts, pedestrians, and vibrant street life.",
    "Traditional Japanese garden with koi pond, stone lanterns, and maple trees.",
    "Modern bedroom with minimalist furniture, large windows, and natural morning light.",
    "University campus with brick buildings, green lawns, and students walking.",
    "Mountain trail with forest path, tall trees, and dappled sunlight.",
    "Art studio with easels, paintings, large windows, and creative atmosphere.",
    "Train station platform with waiting benches, schedule boards, and afternoon light.",
    "Botanical garden greenhouse with exotic plants, glass ceiling, and humid atmosphere.",
    "City park fountain with surrounding benches, flowerbeds, and families relaxing.",
    "Bookstore interior with tall shelves, cozy reading nooks, and warm yellow lighting.",
    "Riverside walkway with bridge view, flowing water, and evening golden hour.",
    "School gymnasium with basketball court, high ceiling, and bright fluorescent lights.",
    "Countryside road with wheat fields on both sides and endless blue sky.",
    "Music room with piano, sheet music stands, and afternoon sun through curtains.",
    "Harbor dock with boats, seagulls, and shimmering water reflections.",
    "Forest clearing with sunbeams breaking through tree canopy and green moss.",
    "Shopping mall atrium with multiple floors, skylights, and modern architecture.",
    "Aquarium tunnel with fish swimming overhead and blue ambient lighting.",
    "Temple grounds with stone steps, torii gates, and peaceful atmosphere.",
    "Science laboratory with equipment, beakers, and clean white lighting.",
    "Amusement park with ferris wheel, colorful rides, and festive atmosphere.",
    "Bamboo forest with tall green stalks and filtered green light.",
    "Airport terminal with large windows, seating areas, and busy travelers.",
    "Kitchen with modern appliances, marble counters, and warm overhead lighting.",
    "Sports field with running track, bleachers, and clear afternoon sky.",
    "Observatory deck with telescope, star charts, and night sky view.",
    "Zen meditation garden with raked sand, rocks, and minimalist design.",
    "Arcade with colorful game machines, neon lights, and energetic atmosphere.",
    "Bakery interior with display cases, fresh bread, and cozy warm lighting.",
    "Planetarium dome with projected stars and dark immersive atmosphere.",
    "Ice skating rink with smooth ice surface and winter decorations.",
    "Conservatory with classical architecture, indoor garden, and natural light.",
    "Comic book store with shelves of manga, posters, and colorful displays.",
    "Theater stage with red curtains, spotlight, and empty seats.",
    "Photography studio with white backdrop, lighting equipment, and cameras.",
    "Onsen hot spring with outdoor bath, bamboo fences, and steam rising.",
    "Subway platform with modern trains, tile walls, and fluorescent lighting.",
    "Farmer's market with produce stalls, colorful vegetables, and cheerful vendors.",
    "Castle courtyard with stone walls, flags, and medieval atmosphere.",
    "Recording studio with soundproofing, mixing board, and microphones.",
    "Lighthouse cliff with ocean view, rocky shore, and dramatic sky.",
    "Greenhouse garden with rows of plants, watering cans, and humid warmth.",
    "Dojo training hall with wooden floor, practice equipment, and traditional decor.",
    "Observatory hilltop with clear night sky, stars, and telescope equipment.",
    "Waterfall grotto with cascading water, mist, and lush green vegetation.",
    "Fashion boutique with clothing racks, mirrors, and elegant interior design.",
    "Camping site with tent, campfire, and starry night sky.",
    "Pottery workshop with clay wheels, finished pieces, and natural lighting.",
    "Cable car station with mountain views, platform, and alpine atmosphere.",
    "Night market with lanterns, food stalls, and bustling crowd.",
    "Yoga studio with wooden floor, large mirrors, and calming atmosphere.",
    "Treehouse platform with wooden planks, rope ladder, and forest canopy view.",
    "Fencing hall with practice mats, equipment racks, and bright lighting.",
    "Autumn park path with fallen leaves, bare trees, and golden afternoon light.",
    "Winter wonderland with snow-covered trees, white landscape, and soft daylight.",
    "Rainy street with puddles, umbrellas, and reflective wet pavement.",
    "Fireworks festival with night sky, colorful explosions, and excited crowd.",
    "Sunrise mountaintop with clouds below, orange sky, and breathtaking vista.",
    "Moonlit lake with calm water, full moon reflection, and peaceful night.",
    "Rainbow meadow after rain with colorful arc, wet grass, and clearing sky.",
    "Starry desert night with sand dunes, clear sky, and Milky Way visible.",
    "Foggy forest morning with mist between trees and mysterious atmosphere.",
    "Sunset pier with orange horizon, silhouettes, and romantic mood.",
    "Spring tulip garden with rows of colorful flowers and bright daylight.",
    "Snowy cabin exterior with smoke from chimney, pine trees, and cozy feel.",
    "Tropical resort pool with palm trees, clear water, and sunny weather.",
    "Medieval village square with cobblestones, old buildings, and market stalls.",
    "Futuristic city with flying vehicles, neon signs, and cyberpunk atmosphere.",
    "Vineyard hillside with grape vines, rolling hills, and golden sunset.",
    "Coral reef underwater with tropical fish, clear water, and sunlight filtering.",
    "Ancient ruins with stone columns, overgrown vegetation, and historical atmosphere.",
    "Northern lights sky with aurora borealis, snowy ground, and magical night.",
    "Lavender field with purple rows, provence atmosphere, and summer sunshine.",
    "Crystal cave with glowing formations, mineral colors, and mystical lighting.",
    "Clocktower interior with gears, mechanisms, and vintage industrial design.",
    "Floating sky islands with waterfalls, clouds, and fantasy atmosphere.",
    "Lantern festival night with hundreds of floating lights and dark sky.",
    "Secret garden with overgrown plants, hidden path, and enchanted feeling.",
    "Cozy attic room with slanted ceiling, window seat, and afternoon sun.",
    "Grand ballroom with chandeliers, polished floor, and elegant architecture.",
    "Misty morning bridge over river with fog, stone architecture, and serene mood.",
    "Carnival at dusk with rides lighting up, cotton candy stands, and excitement.",
    "Sakura tunnel with cherry trees forming arch, petals falling, and pink atmosphere.",
    "Starship bridge with control panels, viewscreen, and science fiction setting.",
    "Enchanted forest with glowing mushrooms, fairy lights, and magical ambiance.",
    "Racing circuit with checkered flags, grandstands, and energetic sports atmosphere.",
    "Penthouse balcony with city night view, luxury furniture, and twinkling lights.",
    "Underground cavern with stalactites, underground lake, and dramatic natural lighting.",
    "Zen rock garden with carefully placed stones, raked patterns, and meditative calm.",
    "Floating market with boats, vendors, and colorful tropical setting."
  ]
}
